<?php

namespace Database\Seeders;

use App\Models\CategoryService;
use Illuminate\Database\Console\Seeds\WithoutModelEvents;
use Illuminate\Database\Seeder;

class CategoryServiceSeeder extends Seeder
{
    /**
     * Run the database seeds.
     */
    public function run(): void
    {
        // масаж спини, класичний
        CategoryService::create([
            'service_id' => 1,
            'category_id' => 1,
            'description' => 'Класичний масаж спини проводиться за допомогою масування та розтягування спинних м\'язів руками. При правильному виконанні основних прийомів масажу можна позбутися больових відчуттів, набряклості, спайок, що утворилися, а також надати стимулюючий вплив на кровообіг.'
        ]);

        // масаж спини, точковий
        CategoryService::create([
            'service_id' => 2,
            'category_id' => 1,
            'description' => 'Точковий масаж спини - це вплив на меридіани і розташовані на них точки в області спини. Правильно впливаючи на потрібні точки, фахівець знімає м\'язову напругу, покращує кровообіг та живлення тканин, активізує обмін речовин.'
        ]);

        // масаж спини, спортивний
        CategoryService::create([
            'service_id' => 3,
            'category_id' => 1,
            'description' => 'Спортивний масаж спини - це вид масажу, який застосовується для розслаблення та відновлення м\'язів спини після фізичного навантаження, травми або покращення спортивних результатів. Він виконується професійним масажистом, який використовує різні техніки та методи для досягнення певних цілей.'
        ]);

        // масаж обличчя, класичний
        CategoryService::create([
            'service_id' => 1,
            'category_id' => 2,
            'description' => 'Класичний масаж обличчя – це комбінація прийомів, за допомогою яких руками впливають на шкіру обличчя. В якості прийомів використовуються розтирання і постукування по особливим масажним лініям.'
        ]);

        // масаж обличчя, точковий
        CategoryService::create([
            'service_id' => 2,
            'category_id' => 2,
            'description' => 'Точковий масаж обличчя - це метод масажу, в якому застосовуються різні точкові техніки для стимуляції певних активних точок на обличчі. Цей вид масажу базується на засадах традиційної китайської медицини та рефлексології.'
        ]);

        // масаж обличчя, лімфодренажний
        CategoryService::create([
            'service_id' => 4,
            'category_id' => 2,
            'description' => 'Лімфодренажний масаж обличчя - ручна або апаратна маніпуляція, яка спрямована на активацію відтоку венозної крові та лімфи, поліпшення циркуляції крові. Рухи виконуються уздовж лімфатичних судин, щоб посилити рух лімфи.'
        ]);
    }
}
